#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag                   = "9dfa898706165e06fee5786a51040cb4" -> "ec8b4936976d1e802f62b56dc583398a"
        id                     = "lambdas/demo/add_investment_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag                   = "f7d4edc078bda15294565d6cfdbb4737" -> "d9081327f03127c511db9097f8bbecd2"
        id                     = "lambdas/demo/add_scenario_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag                   = "970b7c4bf1defaa1f499971e2f7dadc3" -> "a44fe5a2d7276ac349566c819a0036e0"
        id                     = "lambdas/demo/add_tag_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag                   = "3fa3575a0f5112e5c8c40afd55a758b0" -> "9d48110f7d3eb891acf508dd5a996bb6"
        id                     = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag                   = "0d464f3283f262cbf398ef393004c540" -> "017b1cadb7bb52055c703a5a664fc654"
        id                     = "lambdas/demo/assign_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag                   = "016542daaf80f0c180aa8f18538d3dfc" -> "46edf2278ad7fd03b6a6d321609a039c"
        id                     = "lambdas/demo/authorize_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag                   = "c6259c5a67c3cf8fb3ac4bedf5ccd3b6" -> "05a0c2347fc8fcad86e3b35eb0367f50"
        id                     = "lambdas/demo/change_company_publicly_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag                   = "46680c67f504af0c44590134fa7ab838" -> "37083c085f0627fb0998d86f65c3b33b"
        id                     = "lambdas/demo/change_user_role_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag                   = "73b6dc0f9e328b1816fa39283cff23ad" -> "2b46082a1a3811fe5ba33c29c4f9d1e3"
        id                     = "lambdas/demo/connect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag                   = "17fadbf5bf91ace5143a5bff090faa0b" -> "f200ed9287b9d6dc9e418b44015e95c4"
        id                     = "lambdas/demo/delete_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag                   = "fc0e5fcadb4245c70c1bd5b2aa565be6" -> "b258089922a6d4b2dfdc153e299e6fb1"
        id                     = "lambdas/demo/delete_scenarios_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag                   = "cf54d329a8f017242dc7a520d6e36bc7" -> "504b3185e525e7393d53fb7ca2109b84"
        id                     = "lambdas/demo/delete_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag                   = "85f36bc683aed55811b365952aaff534" -> "ffdc8d93c14fd7b4220011aa2c25a651"
        id                     = "lambdas/demo/disconnect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag                   = "4e856f4d1b73d6a2d45357bffae91d5a" -> "1519d8a1906bb50a168b9a01a333b476"
        id                     = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag                   = "2a0240eaea5433be9626abd29dcca298" -> "4cc60d5cc06e0c511b07bf04083d66b6"
        id                     = "lambdas/demo/edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag                   = "c2226ca979dca0e1937d757a23368892" -> "9cbd1766ee38ab3b973fd7993068d556"
        id                     = "lambdas/demo/get_all_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag                   = "b3b756f720dc6616e83d10ce3c3b23a6" -> "54a56889995be09a0575f98a18a59967"
        id                     = "lambdas/demo/get_all_public_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag                   = "e88e48fbf7e3454e6ba1b752b7200074" -> "fdb122c5f650a35023f1d19d25d56269"
        id                     = "lambdas/demo/get_all_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag                   = "15d804038a669bbedba23babc581ca02" -> "97721e65c9ae61093717a7b736df4840"
        id                     = "lambdas/demo/get_all_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag                   = "a951b2420b06664046f510d417b58cf1" -> "06d54c6ab82c1eccf4e69a672cc197d6"
        id                     = "lambdas/demo/get_by_metric_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag                   = "4ae13af65e628ac94e0a4a61409a27d0" -> "3e25d08bdb4582ae474718f5ce31a06e"
        id                     = "lambdas/demo/get_company_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag                   = "4b710a6eb51ffb8a3cbdcf1a00d8bd6d" -> "28716d948b024d3a065add26d297d8cd"
        id                     = "lambdas/demo/get_company_investments_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag                   = "38eb2b445c60b083aae5bc5b013eebe7" -> "ad397327c3b2e54134f8aa094498d957"
        id                     = "lambdas/demo/get_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag                   = "1dfb7ebc0fcaaad1afa567aaef27b5eb" -> "8e20c0f4c4216b942f7d065628e6d5d5"
        id                     = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag                   = "289c3dd493563906c7488b5fdc5c0604" -> "2e232cb8453727ee97b5eb78dfe92c10"
        id                     = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag                   = "cb3fee2cc35e48109801f753484ff7ac" -> "6de2cec8cd8cfe05a91436234fa864d1"
        id                     = "lambdas/demo/get_dynamic_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag                   = "e38f25ef87b26bb1c8177263d0a36c2f" -> "d1be1b3b22abed0ed0ebc0dc89bbc2ec"
        id                     = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag                   = "abbc5edf82350fb0547c107088d026c9" -> "07dd7a29a87dc1282025c620328598e5"
        id                     = "lambdas/demo/get_full_year_total_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag                   = "c6467d705ac18c70bab6f2ab56032e78" -> "5bab922a6e3f1d32ae09b7c3023b19ea"
        id                     = "lambdas/demo/get_investment_date_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag                   = "1b084492e1b80e145b9ea3392fc6c8ab" -> "081ea64751a2dbf63795690c085388c5"
        id                     = "lambdas/demo/get_metric_types_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_quarters_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_quarters_report_function_object" {
      ~ etag                   = "62d7077847632fb1ffdaedccafd5961c" -> "e66e301c68af307f21331008554f8a84"
        id                     = "lambdas/demo/get_quarters_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag                   = "53fd74a9e5ad9dc42689d9662223183b" -> "4cb910af3f11972d036ce2f60ded7487"
        id                     = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag                   = "c0eb681921fb2e54d75154546bb7a128" -> "0561359bcce3e0711f9dff389079a0cf"
        id                     = "lambdas/demo/get_roles_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag                   = "b1c641e4df619b5937437173fcc85642" -> "4c15e67bea0f21ecf86c4e1c816b8889"
        id                     = "lambdas/demo/get_tags_by_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag                   = "3a0a082f04922f129fa7cea523f8f1da" -> "113196c98f9cc699c23842e4a4b71632"
        id                     = "lambdas/demo/get_universe_overview_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag                   = "db024e45b13fc4edd5998723f8c07434" -> "a6a3d9cad0974553712ac19ca41d123e"
        id                     = "lambdas/demo/get_user_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag                   = "769882068a1d2207aa75ad4d4b090054" -> "516ad294f9d61870d57a571b155f5076"
        id                     = "lambdas/demo/get_users_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag                   = "d3645613e032a32a24478e03c698c453" -> "cc0cc67044aaeb9750a311d853409251"
        id                     = "lambdas/demo/glue_trigger_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag                   = "cfdf65af28517a3028b411b05c3945c8" -> "42ebbe7cb16fb14d283000c74a8cffe1"
        id                     = "layer/demo/layer_libraries.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag                   = "570ebd803319745416a5ec1c2e3b3d1e" -> "3c30c0e148d62362d5cd432892b957f8"
        id                     = "lambdas/demo/message.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag                   = "9bd92fbf2e3c88037ae4d40d95ae30da" -> "406ba7b5321f7d1595484ba009a00a6b"
        id                     = "lambdas/demo/modify_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag                   = "4894514ec3154ab067ac95c5109879b3" -> "662299a7d5ef2718006372bc9edf88a8"
        id                     = "lambdas/demo/register.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag                   = "2a9498fc952184fe7fe5f33f28d79297" -> "8d668c549334577ad2eaf544edb24476"
        id                     = "lambdas/demo/update_data.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag                   = "73d080922ea50a7347c063a932894f7c" -> "30ab92bbbb84e710b07e0d98b36c7699"
        id                     = "lambdas/demo/update_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag                   = "81b0157ed85d1c597d65afe145175ac9" -> "454ad66421e4a024dabc92b9ee89ee4f"
        id                     = "lambdas/demo/upload_file_s3_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag                   = "71d3e0a7ccf4fb1585ad81053fa793f6" -> "b7ba23a669afac23a2b52ade0f6dc1c3"
        id                     = "lambdas/demo/validate_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag                   = "55f28fa4dd4a73b65b546d9198b4f5cd" -> "4363e2b38d335cc6e8173eb27f2ca612"
        id                     = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "vr7QrhnFA8t9frYLxEk3+sgOQwgxvoCJ3v/xZQWqajw=" -> "6uyvH7UD/Ay0TtFUVEOdmRihJ1GGWr604xQp3xTAQwc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "OfKiET7fSTptKruCAi3eIfVpvo1AaKOssyfXwb41WnE=" -> "OB2x+EWLBAEks9V8n6mNBRlNFAwp3s82VsWMUORuk+Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "S4ee+qHw8+SM/BDZJU1boiGllIG2EPOskqAXyHr++fY=" -> "G4N0eC7JWvqshdcjsGO8U4X1UquJJh8+jc7He1xpVR0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "CaVX2Xf6WjmmlEWACLVBKDPapUE/RuV8fOZEYq/auKs=" -> "dM6+QX6riOnzVu0kCUV2ARqEcddkX8jv9Upgbf5/vRQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "NOwxYsyEDmsLGOpTAnLftN7FC97RVb/Th1diQHwwXlc=" -> "rkdrTaQ3AS+nkxoN4/WO4JIVb7sWmkH2WKnKasVP+og="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "WZuN1QLX5A0bMwgp1PnP6FGDTvoVzD9der+Zvflc6o4=" -> "+rWsHoFSYXKpfkOWU1Ytk5MA0o2erIN57uYD/3iS2WM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "CcIxqTF7qPtWfTkShvjh7XkvjPxPC5g9gI69l+/O3WA=" -> "9JYrfgraNuCZz9GBCrD9R4XrtUcbCqAy/SHMJ5qwToU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "QFwEsl5V9rTSbBXtOq9/3GetewBME9ft5t6ndqMJOq0=" -> "Ahf6nv373egxGSyZvxMciALZBnf3cnWR8pOBdc8yNIQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "GmGWM8ttJWYL2bxlEkkqKIPE9jG+7PwW+i2nAgSIIxs=" -> "KtdtZJZtA5Jh8dDghYI0HK1egP2i5ODphmQ9RvLt6xw="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "BpmH+dwHEYjKrUWMr8krlWtFN05z2qxW5bzqN/b7M2I=" -> "OYkKSqCtH3sYZItAjYocpvGgXur/m/VSDluYH9ZGMp8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "iYC48jujmYvuimJJ5OnhtKKgTMYySsYGnn1D/MZNUCs=" -> "YUFJ+OvwZYAXADs+2MSzpOt6zZG/bM05PhfQ23ukSBA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "jF7kV8VgN0fvl7DhjsNUF435u3gqVHKxmozUU0KQQ5c=" -> "JZKXe+p4C+L5elohT8vcQoIqUK06axtkkC1qzj3yrjs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "V/fGpvPr7mk7kXto08QfyMgLyVNu0l/iE1Ohy3aEpGg=" -> "3XWZaGcfwE27Mp6uztRIJTmiIJ1O607x9fLIRtLDUf8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "9V9ulfqtQpRnv04XCDI4td/RQcpY1WiWmvu1GLaYUIc=" -> "wVw5SLFqIfWObqUcbT+qqaJ9RscgUKa7Ozowu4NzpLo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "kAD5QQO1vw881BKmJijTBg1uGb2YwLj3Kgy79NfFP0c=" -> "CmiYCIMeNOtFxN05+G6UlxIWvbIRK/KHWdsGimv9HoQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "hpx8rPd/R1upgj1Evlu8ROO4g6c2F812XhPm2wixlfo=" -> "Mh0hYrJboGptl01kbPaUn6AbvED+KOaBwuAoK4NP/Ww="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZdKjnfBpu1thx2oCBi8ofW+0mYW6l/gT7sLSjvPHOZE=" -> "PqIlYuZ8qLyRqjSQ5nICV+aThLlqbiT+XnWQmOOGre4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "UojKfN8YCvdfMvdiJCfX+mMHqoVxaYrSgNDjKgo6WGo=" -> "RotxFlz7GvpV97pndFJvQTHMZiNNDYq8ZYUfPsCwuTA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "BCg9tUn+7iiyfaLqwLbWgXqc5lHcmEAOfhrEgWHLfTM=" -> "su8DTaMFWdoULNSikoKi5YQSiLg8bKYiMUe6t/R0BQ0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "PntiIDQmYUeA0iaGrl5Bo42F9b/zKz0Jo+vIVl/uqyk=" -> "zkO/doeFaq+YeGHYWCLjvGVzW4DCx70RMbIG6u4v/h4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "cgTg9aqLS/7ad8gEhvyMMSwo+JQa2b6RQdU8ub+Luq4=" -> "b/jD/OK7Mulo0Jsmir4rpEcDv4VG/UfM/R1exvdqEoo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "n8H/BiddRAkkdXQ+O0EgjpGwJJB2ouRkwvmgAC672u8=" -> "+GjU4GdcKiLVv7Vk3Q6iKnA2yOZuFz/0vLR9ES37zJI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "imTynxs4TwjJsaS6tkqyqiU6Bkx5cs02QIQiNvc9Uh8=" -> "VrdX99n6j9VevSbi/ZwTUc/1kFy1D4WZ5YCoZLQTfDU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "c+Vr/Vh1jJUTSOACQmqGwjm7rdxHY0GbW2yrLAMj814=" -> "ut/m0RIEIH4w8wuv327opkTU287IsR9bmXpsJW1x2eI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ux6YyJEo9q7PNdQDXHiwgb0rrRmk+iNWrWTj074hGZ0=" -> "gDY7wCAdwEg+VJGaT7ObAyZExMTAupFdvAWiwg134n0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "dpPlC/ilBFFhxOYXwvzRWfdsBqpybWocnow+rsCBNTI=" -> "zNvwJblimbkBpViTUgRsxNQ9HK8uXfCADo4IGhlm4Ms="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "OiTFYPO+aubAY7r1KgGicMg96e2voqNaTbMpvc2WnIY=" -> "EinyaZg8xgoGwK+6bCq+I5gpuNOLDo08G7bjidEdNXA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "WP7dnjKJfipoQ7Qwd/WMeDoAqKcY9amt8EzIo0Rgm9o=" -> "KYRXnYGax2NkMHB+Q8bZv1VeaeOxjVh5TUrmQ1Yd4kI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "q7UfKocfLxSdFJpx78BH2puJxxlcdJqVMTPR2vQe9vA=" -> "5NpODZuha5foVNpAZ3ZAr15k8TTqYDEmkSZ2gTp5d7U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "tpS1U9Z5EWsbvJ22Gebp2q5d+Rha5ROifSBpRzDe2z4=" -> "BW+tLFfSEvtf4xL5RAn8Lfy3mL3F6p+LnTRUPPRPlUY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_quarters_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_quarters_report_lambda_function" {
        id                             = "demo_get_quarters_report_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "xZh8MKgogEhby4yv+0WzGdPm3BjZGDOWPevuCzLYyHE=" -> "++XJznwJWZ7S5c9vHxO5cCFu+EN526xnYczVG1ghBNE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "hvcVYR9coVEp9/xdxoNbyPwyKM2Hv2trjKWymEY9QCw=" -> "bVoYCABGZZ4LoMj2kG5GV/BtQs0UAJVehrIYJ1JJJcE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "zP9mWIr1qBfsIWU5+X1QavzeBr6JgkxNBFssZsnDwXQ=" -> "VvNRi5/Nn8Ge49v0VhAlPGT/n3fCpEX5sSk+QQBKfLA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "DPl2jPVb+cRwssZ7zZuWbKSwqkVfXOPjwb6UGEcYAhQ=" -> "kmo2TXxjFJcZ4iWJn5V3YeHaVmgBXU9TwC1QbP+AHcg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "S2Q5x/riPAAexMLNJEwtllgImcWdZboGh05VwKodwHc=" -> "81FL7chAqHs5cYmDUUxFD9EFHPBjzXNanLqelJ/mF7o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "JqbHgTvnMAwRBy0/M1NSE3Ni60EH4PCwBfjdHYXVBt4=" -> "PGkbgmhUkfpz6J4NVhHfYDzIwK252p64czakelfE0ec="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "/yJShIEG7ngEWc5BPmKSkJkbaqR56B5MIGAUu+Ga8xM=" -> "lAUyApTFu//MNGJmvDqy0Q2eqkMp0xwCDf+WoKScrCQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "m3D9KozMG7tlqi29QgIIDP6LUfzPzb74ic/9yGZRTao=" -> "UeMjuTZHb4QCYmDsacq+/TO04XDoCKEFjPHdmO9T3MM="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "8W2r67VfWc58ROol2GoZ5Ohg5weHdqEE86MZjH41jjk=" -> "pEpS3YcjOe3f7vdAT2Al1nKKVVfyAuJaY5WIzPEH6cQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "Z6iXU2Xl7Jswk5KptoRuoNFraddADHzEIZz7lqLyX40=" -> "1s9RL0uljL9kXHiY81xjiKSrpsx3mXajc/zNwzS7518="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "xaVn/8EHWkR3pt5t+6o27iEAmuXMWuv9mg4T6OEQtb8=" -> "BcjXdJn6JdlH6YjLd6qLREwKLsD2opg1cyFAq/D8zx0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "Kz3ylBq8c14k13cr2WZQDH47cHOlLGl0NUOVF01ifw0=" -> "8suScBHlHSjV+mVYrGuMpDeoX2WMA/SreZ3g6g2B5y0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "qCP3o5noUURd1OoLCNRC1skcQ7MWc6mcS8Sq6ygCJbI=" -> "PkA+9m2Lo37dJoLlq/si0YoHEhULZgQ/hnesuUC48Ew="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "gJVPbubwmLTDEAz6O6o9/kmPIV9vNahTEHmweTquh6U=" -> "lav9cKXUJsZ1u0bspq/4QtwqlEORg9M8OQ4RsU6/BWk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "02A+jeS74O2i83wYRA4JPKJqWtILDJK5CIrIIG/CzUs=" -> "n2e0Px6mh0/q1X2cArNbUQ4fZPMuQW+heGiw9cXegYU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "L3NIq7fOjadd0meOAQCM/S3Q4hEUci656YK/pYNGdeI=" -> "FJJd4x2yopF90KpFIBO5C/RJXsK3Tn8vF2j/2EVZ8zg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-03-01T03:34:20Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "vzsy71" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-03-01T03:34:19Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-03-01T03:34:18Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 95 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*